Week 02/id_118/NOTE.org
#+TITLE: Week 2 Notes

* Methodologies

** Four Steps Problem Solving Process

*** Clarification

*** List all solutions

*** Code

*** Test

** Consolidate Good Solutions
   - Consolidate all the good solutions for each problem
   - Review before interviews

* Hash Table, Map and Set

** Hash Table

*** Gist
    - Hash tables store key: value pairs
    - Look up the element with time complexity of O(1)
    - Map the key value into a position (index) in the table to speed up the lookup process
      + this mapping function is called a hashing fuction
      + this table storing records is called a hash table

*** Real world implementation
    - Yello pages
    - User lists
    - LRU Cache
    - Redis

*** Hash Function
    - val => Hash Function => index
    - Hash Colision: some values will generate the same index value after mapped by the hash function
    - Solution in Java: use a Linked List, adding another dimension. The downside of this solution is as the linked list grows, it will increase the time complexity, approaching O(n)

*** Big O

**** Time
     - average: O(1) for lookup, insertion, deletion
     - worst: O(n) => Hash Table is degraded to a Linked List

**** Space
     - O(n)

*** Python Docs

**** Dictionary

**** Set

** LeetCoding

*** LeetCode 242 Valid Anagram

**** Though Process
     - To determin if two strings s, t are anagram, they need to be:
       + have the same unique letters
       + the counts of each unique letters are the same
       + use dictionary with key is the letter, value is the count

**** Code

 #+BEGIN_SRC ipython :session :exports both :results output org
class Solution:
    def isAnagram(self, s:str, t: str) -> bool:
        s_d, t_d = {}, {}

        s_d = self._strTodict(s)
        t_d = self._strTodict(t)
        return s_d == t_d
    
    # def _compareDict(self, s_d:dict, t_d:dict) -> bool:
    #     for k in s_d.keys():
    #         if k not in t_d:
    #             return False
    #         else:
    #             if s_d[k] != t_d[k]:
    #                 return False
    #     return True

    def _strTodict(self, s:str) -> dict:
        s_d = {}
        for l in s:
            if l in s_d:
                s_d[l] += 1
            else:
                s_d[l] = 1
        return s_d

def test():
    s = "anagram"
    t = "nagaram"

    sol = Solution()
    print(sol.isAnagram(s, t))

def test2():
    s = "rat"
    t = "car"
    sol = Solution()
    print(sol.isAnagram(s, t))

if __name__ == "__main__":
    test()
    test2()
 #+END_SRC

 #+RESULTS:
 #+begin_src org
True
False
 #+end_src

*** LeetCode 2 Two Sum

